In [1]:
import pandas as pd

In [77]:
>>> df1 = pd.DataFrame({'key': ['foo', 'bar', 'baz', 'foo', 'foo'],
...                     'value': [1, 2, 3, 5, 1]})

>>> df2 = pd.DataFrame({'key': ['foo', 'bar', 'baz', 'foo'],
...                     'value': [5, 6, 7, 8]})

In [78]:
df1

   key  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5
4  foo      1

In [109]:
df2

   key  value
0  foo      5
1  bar      6
2  baz      7
3  foo      8

In [106]:
df1.drop_duplicates(inplace=True)
df1

   key  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5

In [108]:
df2.iloc[2]['key']

'baz'

In [105]:
df1.merge(df2, how='left')

   key  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5
4  foo      1

In [28]:
len(df1)

4

In [29]:
i=3

In [30]:
i+1 == len(df1)

True

In [102]:
df1

   key  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5
4  foo      1

In [103]:
df2

   key  value
0  foo      5
1  bar      6
2  baz      7
3  foo      8

In [46]:
df1.drop([2], inplace=True)

In [48]:
df1.reset_index(inplace=True, drop=True)

In [93]:
pd.concat([c, df2.iloc[[2]]])

   key  value
2  baz      7

In [112]:
c = pd.DataFrame()
d = pd.DataFrame(columns=c.columns)
d

Empty DataFrame
Columns: []
Index: []

In [101]:
for item in df1.rows: 
    print(item)

AttributeError: 'DataFrame' object has no attribute 'rows'

In [72]:
df1.merge(c)

Empty DataFrame
Columns: [key, value]
Index: []

In [89]:
df1

   key  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5
4  foo      1

In [86]:
c = pd.DataFrame(columns=df1.columns)
c

Empty DataFrame
Columns: [key, value]
Index: []

In [87]:
c.merge(df1, how='outer')

   key  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5
4  foo      1